{
  "about_page_title": "About Dongguan Huangjiang Dashan Metal Products Factory",
  "about_page_description": "Learn about Dongguan Huangjiang Dashan Metal Products Factory, specializing in metal spinning and deep drawing since 2001.",
  "about_page_keywords": "metal spinning, deep drawing, metal fabrication, custom metal processing, Dongguan factory",
  "about_us": "About Us",
  "factory_image_alt": "Dongguan Huangjiang Dashan Metal Products Factory",
  "factory_intro": "Established in 2001, Dongguan Huangjiang Dashan Metal Products Factory operates an 8,000-square-meter facility equipped with over 100 advanced machines, including 200-1000T hydraulic presses, 30-200T punch presses, 3D Laser Cutting Machine, large-scale CNC spinning machines, and precision mold processing equipment like lathes, milling machines, grinders, and wire EDM.",
  "factory_expertise": "With extensive experience in large-scale deep drawing, spinning, complex metal forming, and high-precision machining, we process iron, aluminum, copper, and stainless steel up to 1800mm in diameter and 9.0mm in thickness, serving industries such as lighting, machinery, medical, furniture, tableware, appliances, gardening, and crafts.",
  "factory_certification": "Certified with ISO9001:2008 since 2014, we maintain strict quality control to ensure reliable and stable product quality.",
  "factory_founder": "Founded by Mr. Fu Tingsheng, a material forming graduate from a prestigious university and a member of the China Spinning Association, with 30 years of expertise in deep drawing and spinning.",
  "factory_founder2": "Currently, Mr. Fu Tingsheng serves as an External Supervisor for Master’s students in Mechanical Engineering at South China University of Technology, participating in graduate engineering projects and metal forming process guidance, and bridging academic research with industrial manufacturing practice.",
  "factory_founder_certification_alt": "Appointment Certificate of External Master's Supervisor, South China University of Technology",
  "factory_invitation": "We specialize in custom metal manufacturing and support production based on customer drawings or samples.Through strict control of materials, processes, and quality, we ensure accurate production to specifications, consistent quality, and on-time delivery.",
  "our_factory": "Our Factory",
  "expertise": "Our Expertise",
  "certification": "Quality Certification",
  "our_founder": "Our Founder",
  "contact_us": "Contact Us"
}